"""

    >>> from tablo import Tablo

    >>> t = Tablo('X Y Z'.split())
    >>> t.append_row([1, 2.5, 'нет'])
    >>> t.append_row([2, 4.3, 'да'])
    >>> t.print()
    | X | Y   | Z   |
    | 1 | 2.5 | нет |
    | 2 | 4.3 | да  |
    >>> print(t)
    | X | Y   | Z   |
    | 1 | 2.5 | нет |
    | 2 | 4.3 | да  |
    <BLANKLINE>

Парсим заголовок

    >>> s = (
    ... '| X | Y   | Z   |'
    ... )
    >>> t2 = Tablo.from_str(s)
    >>> t2.headers
    ['X', 'Y', 'Z']

Парсим одну строку

    >>> s = (
    ... '| X | Y   | Z   |'
    ... '| 1 | 2.5 | нет |'
    ... )
    >>> t2 = Tablo.from_str(s)
    >>> list(t2[0])
    ['1', '2.5', 'нет']

Парсим несколько строк

    >>> s = (
    ... '| X | Y   | Z   |'
    ... '| 1 | 2.5 | нет |'
    ... '| 2 | 4.3 | да  |'
    ... )
    >>> t2 = Tablo.from_str(s)
    >>> t2.print()
    | X | Y   | Z   |
    | 1 | 2.5 | нет |
    | 2 | 4.3 | да  |

"""
